lib/EWS_Calls/createitem_sendEmailSecretWithAttachment.xml

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
	<t:RequestServerVersion Version="REPLACE_EXCHANGE_VERSION" />
</soap:Header>
<soap:Body>
<m:CreateItem MessageDisposition="SendOnly">
	<m:Items>
		<t:Message>
			<t:Subject>REPLACE_SUBJECT</t:Subject>
			<t:Body BodyType="HTML">REPLACE_HTML_BODY</t:Body>
			<t:Attachments>
				<t:FileAttachment>
					<t:Name>REPLACE_ATTACHMENT_NAME</t:Name>
					<t:IsInline>false</t:IsInline>
					<t:IsContactPhoto>false</t:IsContactPhoto>
					<t:Content>REPLACE_ATTACHMENT_BASE64_CONTENT</t:Content>
				</t:FileAttachment>
			</t:Attachments>
			REPLACE_TO_RECIPIENTS
			REPLACE_CC_RECIPIENTS
			REPLACE_BCC_RECIPIENTS
		</t:Message>
	</m:Items>
</m:CreateItem>
</soap:Body>
</soap:Envelope>